/**
 * 퀵정렬(Quic Sort)
 * avg : O(NlogN)
 * max : O(N^2)
 * 
 * 피벗을 기준으로 작은 값은 왼쪽 큰 값은 오른쪽으로 이동하며 정렬하는 방식
 */

// 1 10 5 8 7 6 4 3 2 9

// pivot 1
// > 1 | 10 5 8 7 6 4 3 2 9

// pivot 10
// > 1 10 | 5 8 7 6 4 3 2 9
// > 1 | 9 5 8 7 6 4 3 2 | 10

// pivot 9
// > 1 9 | 5 8 7 6 4 3 2 | 10
// > 1 | 2 5 8 7 6 4 3 | 9 10

// pivot 2
// > 1 2 | 5 8 7 6 4 3 | 9 10

// pivot 5
// > 1 2 5 | 8 7 6 4 3 | 9 10
// > 1 2 5 | 3 7 6 4 8 | 9 10
// > 1 2 5 | 3 4 6 7 8 | 9 10
// > 1 2 | 4 3 | 5 | 6 7 8 | 9 10

// 4 3 | 5 | 6 7 8
// 처럼 전에 pivot이었던 값이 가운데 껴있으면
// 그 값을 기준으로 왼쪽, 오른쪽 따로 pivot 잡고 정렬함

// 4 3 pivot 4
// > 3 4

// 6 7 8 pivot 6
// > 6 7 8

// 마지막 결과를 합체
// > 1 2 3 4 5 6 7 8 9 10
